Public Member Functions | Protected Member Functions | List of all members
Tracking::Tracker::RunningModeKeyboardHandler Class Reference
Tracker API
Class to derive from, when creating custom keyboard handlers for the tracker's running mode. More...
#include <Tracker.hpp>
 Inheritance diagram for Tracking::Tracker::RunningModeKeyboardHandler:
 Public Member Functions
RunningModeKeyboardHandler (Tracker &tracker)
Constructor for the RunningModeKeyboardHandler.
virtual  | ~RunningModeKeyboardHandler ()
 Protected Member Functions
Tracker &  | GetTracker ()
Gets the parent tracker, where the events will be handled.
virtual DG::EventHandlerResultType  | KeyPressed (const DG::Key::Code &code, DG::Item **item) override
Handles a regular key press event.
virtual DG::EventHandlerResultType  | KeyPressed (const DG::Key::Modifier &modifier, DG::Item **item) override
Handles a modifier key press event.
Detailed Description
Class to derive from, when creating custom keyboard handlers for the tracker's running mode.
Constructor & Destructor Documentation
◆ RunningModeKeyboardHandler()
 Tracking::Tracker::RunningModeKeyboardHandler::RunningModeKeyboardHandler  |  ( |  Tracker & |  tracker | )
Constructor for the RunningModeKeyboardHandler.
Parameters
[in] | tracker | the parent tracker, where the events will be handled
◆ ~RunningModeKeyboardHandler()
 virtual Tracking::Tracker::RunningModeKeyboardHandler::~RunningModeKeyboardHandler  |  ( |   | )
virtual
Destructor